<a href="https://colab.research.google.com/github/shant-kolekar/dataAnalyticsEssentialModules/blob/main/sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Resources
* Go to Resource: https://www.sqltutorial.org/sql-functions/
* Another: https://www.w3schools.com/sqL/sql_ref_sqlserver.asp

# DateTime Funcitons

## CAST

**Description**:  
Convert or change data type of an expression.

**Syntax**:  
`CAST(expression AS data_type)`

**Parameters**:
- `expression`:  
  - **Type**: Any data type  
  - **Description**: The value to be converted.
  
- `data_type`:  
  - **Type**: Data type  
  - **Description**: The target data type.

**List of Data Types**:
- `date`
- `datetime`
- `time`
- `float`
- `int`
- `decimal`

**Example**:
```sql
SELECT CAST(column_name AS INT) AS NewColumn
FROM table_name;
```

## FORMAT


**Description**:  
Change date/currency to the desired format.

**Syntax**:  
`FORMAT(expression, format_type, culture)`

**Parameters**:
- `expression`:  
  - **Type**: Any data type  
  - **Description**: The value to be formatted.
  
- `format_type`:  
  - **Type**: String  
  - **Description**: Format specifier for numeric or datetime formats.
  
- `culture`:  
  - **Type**: String  
  - **Description**: Optional. Culture code for locale-specific formatting (e.g., 'en-US').

---

### Numeric Format Example:
```sql
SELECT TOP (5) CurrencyRateID,
       EndOfDayRate,
       FORMAT(EndOfDayRate, 'N', 'en-us') AS 'Numeric Format',
       FORMAT(EndOfDayRate, 'G', 'en-us') AS 'General Format',
       FORMAT(EndOfDayRate, 'C', 'en-us') AS 'Currency Format'
FROM Sales.CurrencyRate
ORDER BY CurrencyRateID;

```

| CurrencyRateID | EndOfDayRate | Numeric Format | General Format | Currency Format |
|----------------|--------------|----------------|----------------|-----------------|
| 1              | 1.0002       | 1.00           | 1.0002         | $1.00           |
| 2              | 1.55         | 1.55           | 1.5500         | $1.55           |
| 3              | 1.9419       | 1.94           | 1.9419         | $1.94           |
| 4              | 1.4683       | 1.47           | 1.4683         | $1.47           |
| 5              | 8.2784       | 8.28           | 8.2784         | $8.28           |

## Datetime Format Example:



### Format Specifiers:

| Format Specifier | Description                                  | Example                              |
|------------------|----------------------------------------------|--------------------------------------|
| `dd`             | The day of the month, from 01 to 31.         | `'2009-06-15T13:45:30'` -> `'15'`    |
| `HH`             | The hour, using a 24-hour clock from 00 to 23.| `'2009-06-15T13:45:30'` -> `'13'`    |
| `mm`             | The minute, from 00 to 59.                   | `'2009-06-15T01:45:30'` -> `'45'`    |
| `MM`             | The month, from 01 to 12.                    | `'2009-06-15T13:45:30'` -> `'06'`    |
| `MMMM`           | The full name of the month.                  | `'2009-06-15T13:45:30'` -> `'June'`  |
| `ss`             | The second, from 00 to 59.                   | `'2009-06-15T13:45:30'` -> `'09'`    |
| `yyyy`           | The year as a four-digit number.             | `'2009-06-15T13:45:30'` -> `'2009'`  |


---

### Datetime Format Example Query:

```sql
SELECT
    FORMAT(GETDATE(), 'dd-MM-yyyy') AS 'Formatted Date',
    FORMAT(GETDATE(), 'HH:mm:ss') AS 'Formatted Time';

```
| Formatted Date | Formatted Time |
|----------------|----------------|
| 07-10-2024     | 13:45:30       |